; domain
(define (domain blocksworld-domain)
 (:requirements :adl :typing :constraints :action-costs)
 (:types block)
 (:predicates (clear ?obj - block) 
              (ontable ?obj - block) 
              (handempty) 
              (holding ?obj - block)
              (on ?obj1 - block ?obj2 - block)
 )

 (:action pickup
  :parameters (?obj - block)
  :precondition (and (clear ?obj) (ontable ?obj) (handempty))
  :effect (and 
            (holding ?obj) 
            (not (clear ?obj)) 
            (not (ontable ?obj)) 
            (not (handempty)) 
          )
 ) 
 (:action pickup-double
  :parameters (?obj - block)
  :precondition (and (ontable ?obj) (handempty) (exists (?topobj - block) (and (on ?topobj ?obj) (clear ?topobj))))
  :effect (and 
            (holding ?obj) 
            (not (ontable ?obj)) 
            (not (handempty)) 
            (and 
                (forall (?topobj - block) 
                    (when (on ?topobj ?obj) 
                          (not(clear ?topobj))
                    )
                )
            )
          )
 )
 (:action putdown
  :parameters ( ?obj - block)
  :precondition (and (holding ?obj))
  :effect (and 
            (handempty) 
            (ontable ?obj) 
            (not (holding ?obj)) 
            (forall (?topobj - block) 
                (when (on ?topobj ?obj) 
                      (clear ?topobj)
                )
            )
            (when (not (exists (?topobj - block) (on ?topobj ?obj)))
                (clear ?obj)
            )
           )
 )
 (:action stack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (clear ?underobj) (holding ?obj))
  :effect (and 
            (handempty) 
            (on ?obj ?underobj) 
            (not (clear ?underobj)) 
            (not (holding ?obj)) 
            (forall (?topobj - block) 
                (when (on ?topobj ?obj) 
                      (clear ?topobj)
                )
            )
            (when (not (exists (?topobj - block) (on ?topobj ?obj)))
                (clear ?obj)
            )
          )
 )
 (:action unstack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (on ?obj ?underobj) (clear ?obj) (handempty))
  :effect (and 
            (holding ?obj) 
            (clear ?underobj) 
            (not (on ?obj ?underobj)) 
            (not (clear ?obj)) 
            (not (handempty)) 
          )
  )
 (:action unstack-double
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (on ?obj ?underobj) (handempty) (exists (?topobj - block) (and (on ?topobj ?obj) (clear ?topobj))))
  :effect (and 
            (holding ?obj) 
            (clear ?underobj) 
            (not (on ?obj ?underobj)) 
            (not (handempty)) 
            (and 
                (forall (?topobj - block) 
                    (when (on ?topobj ?obj) 
                          (not(clear ?topobj))
                    )
                )
            ) 
          )
 )
)

; problem
(define (problem blocksworld-problem)
 (:domain blocksworld-domain)
 (:objects
   yellow_block_1 grey_block_1 black_block_1 yellow_block_2 purple_block_1 - block
 )
 (:init (ontable yellow_block_1) (ontable grey_block_1) (on black_block_1 grey_block_1) (ontable yellow_block_2) (on purple_block_1 yellow_block_2) (clear yellow_block_1) (clear black_block_1) (clear purple_block_1) (handempty) (= (total-cost) 0))
 (:goal (and (on grey_block_1 yellow_block_2)))
 (:metric minimize (total-cost))
)

; plan
1. (unstack purple_block_1 yellow_block_2)
   deleted: (on purple_block_1 yellow_block_2) (clear purple_block_1) (handempty)
   added: (holding purple_block_1) (clear yellow_block_2)
   goals met: 0 of 1
2. (putdown purple_block_1)
   deleted: (holding purple_block_1)
   added: (handempty) (ontable purple_block_1) (clear purple_block_1)
   goals met: 0 of 1
3. (unstack black_block_1 grey_block_1)
   deleted: (on black_block_1 grey_block_1) (clear black_block_1) (handempty)
   added: (holding black_block_1) (clear grey_block_1)
   goals met: 0 of 1
4. (putdown black_block_1)
   deleted: (holding black_block_1)
   added: (handempty) (ontable black_block_1) (clear black_block_1)
   goals met: 0 of 1
5. (pickup grey_block_1)
   deleted: (clear grey_block_1) (ontable grey_block_1) (handempty)
   added: (holding grey_block_1)
   goals met: 0 of 1
6. (stack grey_block_1 yellow_block_2)
   deleted: (clear yellow_block_2) (holding grey_block_1)
   added: (handempty) (on grey_block_1 yellow_block_2) (clear grey_block_1)
   goals met: 1 of 1
